[
  {
    "id": "AL",
    "name": "Alabama",
    "about": "Alabama is a state located in the southeastern region of the United States. It is known for its diverse geography, from the mountainous regions in the north to the Gulf Coast in the south. The state has a rich history and culture, particularly in relation to the Civil Rights Movement. Alabama is home to several prestigious universities and has a growing economy with strengths in manufacturing, aerospace, and technology.",
    "capital": "Montgomery",
    "largestCity": "Birmingham",
    "population": "5.03 million (2022)",
    "topIndustries": "Automotive manufacturing, Aerospace, Healthcare, Education, Agriculture",
    "majorUniversities": "University of Alabama, Auburn University, University of Alabama at Birmingham",
    "touristAttractions": "U.S. Space & Rocket Center, Gulf Shores beaches, Birmingham Civil Rights Institute",
    "famousFor": "Southern hospitality, Civil Rights history, College football, NASA's Marshall Space Flight Center"
  },
  {
    "id": "AZ",
    "name": "Arizona",
    "about": "Arizona is a southwestern state known for its desert landscape, including the Grand Canyon. The state offers diverse environments from arid deserts to pine-covered mountains. Arizona has a strong economy focused on technology, manufacturing, and tourism. The state is home to several Native American reservations and has a rich cultural heritage.",
    "capital": "Phoenix",
    "largestCity": "Phoenix",
    "population": "7.4 million (2022)",
    "topIndustries": "Technology, Manufacturing, Tourism, Healthcare, Aerospace and Defense",
    "majorUniversities": "Arizona State University, University of Arizona, Northern Arizona University",
    "touristAttractions": "Grand Canyon, Sedona, Monument Valley, Antelope Canyon, Saguaro National Park",
    "famousFor": "Grand Canyon, Desert landscapes, Native American culture, Retirement communities"
  },
  {
    "id": "AR",
    "name": "Arkansas",
    "about": "Arkansas is a southern state known for its mountains, rivers, hot springs, and caves. The state has diverse geography including the Ozark and Ouachita Mountains, dense forests, and fertile plains. Arkansas has a strong agricultural economy but is also home to major corporations like Walmart. The state offers abundant outdoor recreational opportunities and has a rich cultural heritage.",
    "capital": "Little Rock",
    "largestCity": "Little Rock",
    "population": "3.03 million (2022)",
    "topIndustries": "Agriculture, Retail, Manufacturing, Healthcare, Tourism",
    "majorUniversities": "University of Arkansas, Arkansas State University, University of Central Arkansas",
    "touristAttractions": "Hot Springs National Park, Buffalo National River, Crystal Bridges Museum of American Art",
    "famousFor": "Natural beauty, Walmart headquarters, Hot springs, Diamond mining"
  },
  {
    "id": "CA",
    "name": "California",
    "about": "California is the most populous state in the United States, located on the west coast. It is known for its diverse geography, including beaches, mountains, deserts, and forests. California has the largest economy of any U.S. state and is a global leader in technology, entertainment, agriculture, and tourism. The state is home to many iconic landmarks and attractions.",
    "capital": "Sacramento",
    "largestCity": "Los Angeles",
    "population": "39.2 million (2022)",
    "topIndustries": "Technology, Entertainment, Agriculture, Tourism, Manufacturing",
    "majorUniversities": "Stanford University, University of California system (Berkeley, UCLA, etc.), California Institute of Technology",
    "touristAttractions": "Golden Gate Bridge, Hollywood, Disneyland, Yosemite National Park, Wine Country",
    "famousFor": "Silicon Valley, Hollywood, Beautiful beaches, Wine production, Cultural diversity"
  },
  {
    "id": "CO",
    "name": "Colorado",
    "about": "Colorado is a western U.S. state known for its Rocky Mountain landscapes, outdoor recreation opportunities, and vibrant urban centers. The state has a diverse economy with strengths in aerospace, technology, agriculture, and tourism. Colorado is known for its progressive policies and high quality of life, attracting many new residents in recent years.",
    "capital": "Denver",
    "largestCity": "Denver",
    "population": "5.8 million (2022)",
    "topIndustries": "Aerospace, Technology, Agriculture, Tourism, Energy",
    "majorUniversities": "University of Colorado Boulder, Colorado State University, University of Denver",
    "touristAttractions": "Rocky Mountain National Park, Vail and Aspen ski resorts, Garden of the Gods, Mesa Verde National Park",
    "famousFor": "Skiing and snowboarding, Craft beer, Legalized marijuana, Outdoor lifestyle"
  },
  {
    "id": "CT",
    "name": "Connecticut",
    "about": "Connecticut is a small state in the northeastern United States, known for its rich history, beautiful coastal areas, and proximity to New York City. The state has a strong economy focused on finance, insurance, and manufacturing. Connecticut is home to prestigious universities and has one of the highest per capita incomes in the country.",
    "capital": "Hartford",
    "largestCity": "Bridgeport",
    "population": "3.6 million (2022)",
    "topIndustries": "Finance and Insurance, Manufacturing, Healthcare, Defense, Tourism",
    "majorUniversities": "Yale University, University of Connecticut, Wesleyan University",
    "touristAttractions": "Mystic Seaport, Yale University, Mark Twain House, Gillette Castle State Park",
    "famousFor": "Insurance industry, Yale University, Beautiful fall foliage, Submarine manufacturing"
  },
  {
    "id": "FL",
    "name": "Florida",
    "about": "Florida is a southeastern state known for its sunny climate, beautiful beaches, and diverse ecosystems. The state has a strong economy based on tourism, agriculture, and aerospace. Florida is home to many theme parks, natural attractions, and is a popular retirement destination. The state has a diverse population with strong Hispanic influences, particularly in South Florida.",
    "capital": "Tallahassee",
    "largestCity": "Jacksonville",
    "population": "22.2 million (2022)",
    "topIndustries": "Tourism, Agriculture, Aerospace, International Trade, Healthcare",
    "majorUniversities": "University of Florida, Florida State University, University of Miami",
    "touristAttractions": "Walt Disney World, Universal Studios, Kennedy Space Center, Everglades National Park, Miami Beach",
    "famousFor": "Theme parks, Beaches, Citrus fruits, Retirement communities, Space program"
  },
  {
    "id": "GA",
    "name": "Georgia",
    "about": "Georgia is a southeastern state with diverse landscapes from the Blue Ridge Mountains to the Atlantic coast. The state has a strong economy with strengths in agriculture, film production, and logistics. Georgia is known for its southern hospitality, rich history, and cultural contributions, particularly in music and literature.",
    "capital": "Atlanta",
    "largestCity": "Atlanta",
    "population": "10.9 million (2022)",
    "topIndustries": "Agriculture, Film Production, Logistics, Manufacturing, Technology",
    "majorUniversities": "Georgia Tech, University of Georgia, Emory University",
    "touristAttractions": "Atlanta attractions, Savannah Historic District, Golden Isles, Stone Mountain Park",
    "famousFor": "Peaches, Film industry, Civil Rights history, Coca-Cola, Atlanta as a business hub"
  },
  {
    "id": "IL",
    "name": "Illinois",
    "about": "Illinois is a midwestern state known for its diverse economy, cultural attractions, and natural beauty. The state is home to Chicago, the third-largest city in the United States, as well as vast agricultural areas. Illinois has a strong economy with strengths in manufacturing, agriculture, and financial services.",
    "capital": "Springfield",
    "largestCity": "Chicago",
    "population": "12.6 million (2022)",
    "topIndustries": "Manufacturing, Agriculture, Financial Services, Healthcare, Technology",
    "majorUniversities": "University of Chicago, Northwestern University, University of Illinois system",
    "touristAttractions": "Chicago's Magnificent Mile, Navy Pier, Willis Tower, Abraham Lincoln Presidential Library and Museum",
    "famousFor": "Chicago architecture, Deep dish pizza, Abraham Lincoln, Jazz and blues music"
  },
  {
    "id": "IN",
    "name": "Indiana",
    "about": "Indiana is a midwestern state known for its agricultural heritage, manufacturing strength, and sports traditions. The state has a diverse economy with strengths in manufacturing, agriculture, and healthcare. Indiana is home to several prestigious universities and has a rich cultural heritage.",
    "capital": "Indianapolis",
    "largestCity": "Indianapolis",
    "population": "6.8 million (2022)",
    "topIndustries": "Manufacturing, Agriculture, Healthcare, Logistics, Education",
    "majorUniversities": "Purdue University, Indiana University, Notre Dame University",
    "touristAttractions": "Indianapolis Motor Speedway, Indiana Dunes National Park, Children's Museum of Indianapolis",
    "famousFor": "Indianapolis 500, Basketball heritage, Limestone production, Covered bridges"
  },
  {
    "id": "IA",
    "name": "Iowa",
    "about": "Iowa is a midwestern state known for its agricultural productivity, particularly in corn and soybeans. The state has a diverse economy with strengths in agriculture, manufacturing, and renewable energy. Iowa plays an important role in presidential politics as the first state to hold caucuses during election cycles.",
    "capital": "Des Moines",
    "largestCity": "Des Moines",
    "population": "3.2 million (2022)",
    "topIndustries": "Agriculture, Manufacturing, Renewable Energy, Insurance, Healthcare",
    "majorUniversities": "University of Iowa, Iowa State University, Drake University",
    "touristAttractions": "Field of Dreams movie site, Amana Colonies, National Mississippi River Museum",
    "famousFor": "Corn production, Iowa Caucuses, Covered bridges, State Fair"
  },
  {
    "id": "KS",
    "name": "Kansas",
    "about": "Kansas is a midwestern state known for its agricultural heritage, particularly wheat production. The state has a diverse economy with strengths in agriculture, manufacturing, and energy. Kansas has a rich history related to the American frontier and Civil War periods.",
    "capital": "Topeka",
    "largestCity": "Wichita",
    "population": "2.9 million (2022)",
    "topIndustries": "Agriculture, Manufacturing, Energy, Aviation, Healthcare",
    "majorUniversities": "University of Kansas, Kansas State University, Wichita State University",
    "touristAttractions": "Tallgrass Prairie National Preserve, Eisenhower Presidential Library, Museum and Boyhood Home",
    "famousFor": "Wheat production, The Wizard of Oz, Basketball heritage, Aerospace manufacturing"
  },
  {
    "id": "KY",
    "name": "Kentucky",
    "about": "Kentucky is a southeastern state known for its horse breeding, bourbon production, and beautiful landscapes. The state has a diverse economy with strengths in manufacturing, agriculture, and tourism. Kentucky has a rich cultural heritage, particularly in music, crafts, and food.",
    "capital": "Frankfort",
    "largestCity": "Louisville",
    "population": "4.5 million (2022)",
    "topIndustries": "Manufacturing, Agriculture, Tourism, Healthcare, Logistics",
    "majorUniversities": "University of Kentucky, University of Louisville, Western Kentucky University",
    "touristAttractions": "Kentucky Derby, Mammoth Cave National Park, Bourbon Trail, Kentucky Horse Park",
    "famousFor": "Kentucky Derby, Bourbon whiskey, Bluegrass music, Fried chicken, Horse breeding"
  },
  {
    "id": "LA",
    "name": "Louisiana",
    "about": "Louisiana is a southeastern state known for its unique cultural heritage, particularly its French and Spanish influences. The state has a diverse economy with strengths in energy, tourism, and agriculture. Louisiana is famous for its distinctive cuisine, music, and festivals, especially in New Orleans.",
    "capital": "Baton Rouge",
    "largestCity": "New Orleans",
    "population": "4.6 million (2022)",
    "topIndustries": "Energy, Tourism, Agriculture, Manufacturing, Maritime",
    "majorUniversities": "Louisiana State University, Tulane University, University of Louisiana system",
    "touristAttractions": "French Quarter, Mardi Gras celebrations, Plantation homes, Swamp tours",
    "famousFor": "Cajun and Creole culture, Jazz music, Mardi Gras, Unique cuisine"
  },
  {
    "id": "MD",
    "name": "Maryland",
    "about": "Maryland is a mid-Atlantic state known for its diverse landscapes, from the Chesapeake Bay to the Appalachian Mountains. The state has a strong economy with strengths in biotechnology, healthcare, and defense. Maryland is home to many federal government facilities and has a rich history dating back to colonial times.",
    "capital": "Annapolis",
    "largestCity": "Baltimore",
    "population": "6.2 million (2022)",
    "topIndustries": "Biotechnology, Healthcare, Defense, Information Technology, Tourism",
    "majorUniversities": "Johns Hopkins University, University of Maryland, United States Naval Academy",
    "touristAttractions": "Inner Harbor, Assateague Island, Chesapeake Bay, Historic Annapolis",
    "famousFor": "Blue crabs, The Star-Spangled Banner, Johns Hopkins University, Naval Academy"
  },
  {
    "id": "MA",
    "name": "Massachusetts",
    "about": "Massachusetts is a northeastern state known for its significant role in American history, prestigious educational institutions, and innovation economy. The state has a strong economy with strengths in education, healthcare, technology, and finance. Massachusetts is home to many historical sites related to the American Revolution and has a rich cultural heritage.",
    "capital": "Boston",
    "largestCity": "Boston",
    "population": "7 million (2022)",
    "topIndustries": "Education, Healthcare, Technology, Finance, Biotechnology",
    "majorUniversities": "Harvard University, MIT, Boston University, Northeastern University",
    "touristAttractions": "Freedom Trail, Cape Cod, Martha's Vineyard, Fenway Park, Salem",
    "famousFor": "American Revolution history, Elite universities, Sports teams, Seafood"
  },
  {
    "id": "MI",
    "name": "Michigan",
    "about": "Michigan is a midwestern state known for its automotive industry, Great Lakes coastline, and natural beauty. The state has a diverse economy with strengths in manufacturing, tourism, and agriculture. Michigan is surrounded by four of the five Great Lakes and has more freshwater coastline than any other state.",
    "capital": "Lansing",
    "largestCity": "Detroit",
    "population": "10.1 million (2022)",
    "topIndustries": "Automotive Manufacturing, Tourism, Agriculture, Healthcare, Technology",
    "majorUniversities": "University of Michigan, Michigan State University, Wayne State University",
    "touristAttractions": "Mackinac Island, The Henry Ford Museum, Sleeping Bear Dunes, Detroit Institute of Arts",
    "famousFor": "Automotive industry, Great Lakes, Motown music, Cherry production"
  },
  {
    "id": "MN",
    "name": "Minnesota",
    "about": "Minnesota is a midwestern state known for its 'Land of 10,000 Lakes,' progressive politics, and high quality of life. The state has a diverse economy with strengths in healthcare, manufacturing, and agriculture. Minnesota is known for its cold winters, outdoor recreation opportunities, and strong sense of community.",
    "capital": "Saint Paul",
    "largestCity": "Minneapolis",
    "population": "5.7 million (2022)",
    "topIndustries": "Healthcare, Manufacturing, Agriculture, Financial Services, Technology",
    "majorUniversities": "University of Minnesota, Carleton College, Macalester College",
    "touristAttractions": "Mall of America, Boundary Waters Canoe Area, Minneapolis Institute of Art, North Shore",
    "famousFor": "Lakes, Mall of America, Minnesota Nice, Cold winters, Mayo Clinic"
  },
  {
    "id": "MS",
    "name": "Mississippi",
    "about": "Mississippi is a southern state known for its rich cultural heritage, particularly in music, literature, and food. The state has a diverse economy with strengths in agriculture, manufacturing, and tourism. Mississippi has a complex history related to civil rights and is known for its southern hospitality.",
    "capital": "Jackson",
    "largestCity": "Jackson",
    "population": "2.9 million (2022)",
    "topIndustries": "Agriculture, Manufacturing, Tourism, Healthcare, Forestry",
    "majorUniversities": "University of Mississippi, Mississippi State University, Jackson State University",
    "touristAttractions": "Vicksburg National Military Park, Gulf Islands National Seashore, B.B. King Museum",
    "famousFor": "Blues music, Southern literature, Civil Rights history, Catfish farming"
  },
  {
    "id": "MO",
    "name": "Missouri",
    "about": "Missouri is a midwestern state known for its diverse landscapes, from the Ozark Mountains to the plains of the north. The state has a diverse economy with strengths in agriculture, manufacturing, and tourism. Missouri has a rich cultural heritage, particularly in music, and played an important role in westward expansion.",
    "capital": "Jefferson City",
    "largestCity": "Kansas City",
    "population": "6.2 million (2022)",
    "topIndustries": "Agriculture, Manufacturing, Tourism, Healthcare, Financial Services",
    "majorUniversities": "Washington University in St. Louis, University of Missouri, Saint Louis University",
    "touristAttractions": "Gateway Arch, Branson entertainment district, Lake of the Ozarks, Mark Twain Boyhood Home",
    "famousFor": "Gateway Arch, BBQ, Jazz and blues music, Mark Twain, Brewing heritage"
  },
  {
    "id": "NE",
    "name": "Nebraska",
    "about": "Nebraska is a midwestern state known for its agricultural productivity, particularly in corn and beef. The state has a diverse economy with strengths in agriculture, manufacturing, and insurance. Nebraska is characterized by its Great Plains geography and has a strong sense of community and traditional values.",
    "capital": "Lincoln",
    "largestCity": "Omaha",
    "population": "1.97 million (2022)",
    "topIndustries": "Agriculture, Manufacturing, Insurance, Transportation, Healthcare",
    "majorUniversities": "University of Nebraska-Lincoln, Creighton University, University of Nebraska at Omaha",
    "touristAttractions": "Henry Doorly Zoo, Chimney Rock, Carhenge, Strategic Air Command & Aerospace Museum",
    "famousFor": "Corn production, Beef production, Warren Buffett, College football"
  },
  {
    "id": "NH",
    "name": "New Hampshire",
    "about": "New Hampshire is a northeastern state known for its natural beauty, tax-free shopping, and important role in presidential primaries. The state has a diverse economy with strengths in manufacturing, healthcare, and tourism. New Hampshire is characterized by its independent spirit, reflected in its state motto 'Live Free or Die.'",
    "capital": "Concord",
    "largestCity": "Manchester",
    "population": "1.4 million (2022)",
    "topIndustries": "Manufacturing, Healthcare, Tourism, Technology, Education",
    "majorUniversities": "Dartmouth College, University of New Hampshire, Southern New Hampshire University",
    "touristAttractions": "White Mountains, Lake Winnipesaukee, Portsmouth historic district, Mount Washington",
    "famousFor": "No sales tax, Presidential primaries, Fall foliage, Maple syrup, Outdoor recreation"
  },
  {
    "id": "NJ",
    "name": "New Jersey",
    "about": "New Jersey is a northeastern state known for its diverse population, proximity to New York City, and beautiful beaches. The state has a strong economy with strengths in pharmaceuticals, telecommunications, and transportation. New Jersey is the most densely populated state in the country and offers a mix of urban, suburban, and rural environments.",
    "capital": "Trenton",
    "largestCity": "Newark",
    "population": "9.3 million (2022)",
    "topIndustries": "Pharmaceuticals, Telecommunications, Transportation, Tourism, Manufacturing",
    "majorUniversities": "Princeton University, Rutgers University, Stevens Institute of Technology",
    "touristAttractions": "Jersey Shore, Atlantic City, Liberty State Park, Princeton University campus",
    "famousFor": "Jersey Shore, Diners, Bruce Springsteen, Pharmaceutical industry, Dense population"
  },
  {
    "id": "NM",
    "name": "New Mexico",
    "about": "New Mexico is a southwestern state known for its diverse landscapes, rich cultural heritage, and scientific research facilities. The state has a diverse economy with strengths in energy, tourism, and government research. New Mexico has a unique blend of Native American, Hispanic, and Anglo cultures, reflected in its architecture, cuisine, and traditions.",
    "capital": "Santa Fe",
    "largestCity": "Albuquerque",
    "population": "2.1 million (2022)",
    "topIndustries": "Energy, Tourism, Government Research, Agriculture, Film Production",
    "majorUniversities": "University of New Mexico, New Mexico State University, New Mexico Tech",
    "touristAttractions": "Carlsbad Caverns, White Sands National Park, Santa Fe Plaza, Taos Pueblo",
    "famousFor": "Native American and Hispanic culture, Green chile cuisine, Art scene, Los Alamos National Laboratory"
  },
  {
    "id": "NY",
    "name": "New York",
    "about": "New York is a northeastern state known for New York City, the most populous city in the United States, as well as diverse upstate regions. The state has a strong economy with strengths in finance, media, technology, and tourism. New York is a global cultural center with significant contributions to art, literature, music, and cuisine.",
    "capital": "Albany",
    "largestCity": "New York City",
    "population": "20.2 million (2022)",
    "topIndustries": "Finance, Media, Technology, Tourism, Healthcare",
    "majorUniversities": "Columbia University, Cornell University, NYU, SUNY system",
    "touristAttractions": "Statue of Liberty, Times Square, Central Park, Niagara Falls, Empire State Building",
    "famousFor": "New York City, Wall Street, Broadway, Niagara Falls, Cultural diversity"
  },
  {
    "id": "NC",
    "name": "North Carolina",
    "about": "North Carolina is a southeastern state known for its diverse geography, from the Appalachian Mountains to the Atlantic coast. The state has a strong economy with strengths in banking, technology, and manufacturing. North Carolina is known for its universities, research facilities, and growing urban centers.",
    "capital": "Raleigh",
    "largestCity": "Charlotte",
    "population": "10.7 million (2022)",
    "topIndustries": "Banking, Technology, Manufacturing, Agriculture, Healthcare",
    "majorUniversities": "Duke University, UNC Chapel Hill, NC State University, Wake Forest University",
    "touristAttractions": "Great Smoky Mountains National Park, Outer Banks, Biltmore Estate, Charlotte Motor Speedway",
    "famousFor": "Banking industry, Research Triangle Park, College basketball, BBQ, Outer Banks"
  },
  {
    "id": "OH",
    "name": "Ohio",
    "about": "Ohio is a midwestern state known for its industrial heritage, agricultural productivity, and political importance. The state has a diverse economy with strengths in manufacturing, healthcare, and education. Ohio is often considered a bellwether in presidential elections and has produced several U.S. presidents.",
    "capital": "Columbus",
    "largestCity": "Columbus",
    "population": "11.8 million (2022)",
    "topIndustries": "Manufacturing, Healthcare, Education, Agriculture, Financial Services",
    "majorUniversities": "Ohio State University, Case Western Reserve, University of Cincinnati",
    "touristAttractions": "Rock & Roll Hall of Fame, Cedar Point, Hocking Hills State Park, Pro Football Hall of Fame",
    "famousFor": "Rock & Roll Hall of Fame, Ohio State football, Aviation pioneers, Presidential candidates"
  },
  {
    "id": "OK",
    "name": "Oklahoma",
    "about": "Oklahoma is a southwestern state known for its Native American heritage, energy production, and diverse landscapes. The state has a diverse economy with strengths in energy, agriculture, and aviation. Oklahoma has a rich cultural heritage, particularly related to Native American tribes and Western traditions.",
    "capital": "Oklahoma City",
    "largestCity": "Oklahoma City",
    "population": "4 million (2022)",
    "topIndustries": "Energy, Agriculture, Aviation, Healthcare, Manufacturing",
    "majorUniversities": "University of Oklahoma, Oklahoma State University, University of Tulsa",
    "touristAttractions": "National Cowboy & Western Heritage Museum, Oklahoma City National Memorial, Philbrook Museum of Art",
    "famousFor": "Native American culture, Oil industry, Cowboy heritage, Tornadoes, Red dirt music"
  },
  {
    "id": "OR",
    "name": "Oregon",
    "about": "Oregon is a western state known for its diverse landscapes, from the Pacific coast to mountains, forests, and high desert. The state has a diverse economy with strengths in technology, agriculture, and tourism. Oregon is known for its progressive politics, outdoor recreation opportunities, and commitment to sustainability.",
    "capital": "Salem",
    "largestCity": "Portland",
    "population": "4.2 million (2022)",
    "topIndustries": "Technology, Agriculture, Tourism, Forestry, Manufacturing",
    "majorUniversities": "University of Oregon, Oregon State University, Portland State University",
    "touristAttractions": "Crater Lake National Park, Columbia River Gorge, Portland attractions, Oregon Coast",
    "famousFor": "Natural beauty, Portland's quirky culture, Nike headquarters, Craft beer, No sales tax"
  },
  {
    "id": "PA",
    "name": "Pennsylvania",
    "about": "Pennsylvania is a northeastern state known for its role in American history, diverse economy, and varied landscapes. The state has a strong economy with strengths in manufacturing, agriculture, and services. Pennsylvania played a crucial role in the founding of the United States and has a rich cultural heritage.",
    "capital": "Harrisburg",
    "largestCity": "Philadelphia",
    "population": "13 million (2022)",
    "topIndustries": "Manufacturing, Agriculture, Healthcare, Technology, Energy",
    "majorUniversities": "University of Pennsylvania, Carnegie Mellon, Penn State University, University of Pittsburgh",
    "touristAttractions": "Independence Hall, Liberty Bell, Gettysburg National Military Park, Hershey Park, Amish Country",
    "famousFor": "American Revolution history, Steel industry, Chocolate production, Amish communities"
  },
  {
    "id": "SC",
    "name": "South Carolina",
    "about": "South Carolina is a southeastern state known for its beaches, historic sites, and southern hospitality. The state has a diverse economy with strengths in manufacturing, tourism, and agriculture. South Carolina has a rich history dating back to colonial times and played a significant role in the Civil War.",
    "capital": "Columbia",
    "largestCity": "Charleston",
    "population": "5.2 million (2022)",
    "topIndustries": "Manufacturing, Tourism, Agriculture, Healthcare, Military",
    "majorUniversities": "University of South Carolina, Clemson University, College of Charleston",
    "touristAttractions": "Charleston Historic District, Myrtle Beach, Hilton Head Island, Fort Sumter National Monument",
    "famousFor": "Beaches, Historic Charleston, Palmetto trees, Southern cuisine, Golf courses"
  },
  {
    "id": "TN",
    "name": "Tennessee",
    "about": "Tennessee is a southeastern state known for its contributions to music, particularly country, blues, and rock 'n' roll. The state has a diverse economy with strengths in healthcare, manufacturing, and tourism. Tennessee has varied geography, from the Appalachian Mountains in the east to the Mississippi River in the west.",
    "capital": "Nashville",
    "largestCity": "Nashville",
    "population": "7 million (2022)",
    "topIndustries": "Healthcare, Manufacturing, Tourism, Agriculture, Music and Entertainment",
    "majorUniversities": "Vanderbilt University, University of Tennessee, Rhodes College",
    "touristAttractions": "Great Smoky Mountains National Park, Graceland, Grand Ole Opry, Jack Daniel's Distillery",
    "famousFor": "Country music, Elvis Presley, Whiskey production, Great Smoky Mountains"
  },
  {
    "id": "UT",
    "name": "Utah",
    "about": "Utah is a western state known for its stunning landscapes, outdoor recreation opportunities, and Mormon heritage. The state has a diverse economy with strengths in technology, tourism, and mining. Utah is characterized by its natural beauty, with five national parks and numerous other protected areas.",
    "capital": "Salt Lake City",
    "largestCity": "Salt Lake City",
    "population": "3.4 million (2022)",
    "topIndustries": "Technology, Tourism, Mining, Healthcare, Manufacturing",
    "majorUniversities": "University of Utah, Brigham Young University, Utah State University",
    "touristAttractions": "Zion National Park, Arches National Park, Salt Lake Temple, Park City ski resorts",
    "famousFor": "National parks, Mormon heritage, Skiing and snowboarding, Salt Lake, Tech industry growth"
  },
  {
    "id": "VA",
    "name": "Virginia",
    "about": "Virginia is a mid-Atlantic state known for its role in American history, government facilities, and diverse landscapes. The state has a strong economy with strengths in defense, technology, and agriculture. Virginia is home to many federal government agencies and military installations.",
    "capital": "Richmond",
    "largestCity": "Virginia Beach",
    "population": "8.6 million (2022)",
    "topIndustries": "Defense, Technology, Agriculture, Tourism, Healthcare",
    "majorUniversities": "University of Virginia, Virginia Tech, College of William & Mary",
    "touristAttractions": "Colonial Williamsburg, Shenandoah National Park, Virginia Beach, Mount Vernon",
    "famousFor": "American history, Government and military presence, Virginia ham, Seafood, Wine production"
  },
  {
    "id": "WA",
    "name": "Washington",
    "about": "Washington is a northwestern state known for its technology industry, natural beauty, and progressive politics. The state has a diverse economy with strengths in technology, aerospace, agriculture, and trade. Washington is characterized by its varied landscapes, from the Cascade Mountains to the Pacific coast.",
    "capital": "Olympia",
    "largestCity": "Seattle",
    "population": "7.7 million (2022)",
    "topIndustries": "Technology, Aerospace, Agriculture, Trade, Healthcare",
    "majorUniversities": "University of Washington, Washington State University, Gonzaga University",
    "touristAttractions": "Space Needle, Mount Rainier National Park, Olympic National Park, Pike Place Market",
    "famousFor": "Tech industry, Coffee culture, Rainy weather, Apples, Outdoor recreation"
  }
] 